# 190031920
# A Nikhil Reddy
# DS Skill 1

In [1]:
import pandas as pd
import numpy as np

In [2]:
list = ['apple','banana','orange','grape']
series = pd.Series(list)
print(series)

0     apple
1    banana
2    orange
3     grape
dtype: object

In [3]:
d=['kishan','tejesh','vyshnav','goutham','anirudh']
m=[[78,66,69,75],[88,68,79,77],[70,80,90,60],[88,66,77,89],[69,64,82,72]]
s=['AI','OOPS','MP2','CNS']

In [4]:
df = pd.DataFrame(data=m,index=d,columns=s)

In [5]:
df

,AI,OOPS,MP2,CNS
kishan,78,66,69,75
tejesh,88,68,79,77
student 3,70,80,90,60
student 4,88,66,77,89
student 5,69,64,82,72

In [6]:
z = df.iloc[1:,:2]

In [7]:
z

,AI,OOPS
tejesh,88,68
student 3,70,80
student 4,88,66
student 5,69,64

In [8]:
df['SPI'] = df['MP2']+df['AI']
df

,AI,OOPS,MP2,CNS,SPI
kishan,78,66,69,75,147
tejesh,88,68,79,77,167
student 3,70,80,90,60,160
student 4,88,66,77,89,165
student 5,69,64,82,72,151

In [9]:
df['total']=df['AI']+df['OOPS']+df['MP2']+df['CNS']
df

,AI,OOPS,MP2,CNS,SPI,total
kishan,78,66,69,75,147,288
tejesh,88,68,79,77,167,312
student 3,70,80,90,60,160,300
student 4,88,66,77,89,165,320
student 5,69,64,82,72,151,287

In [10]:
df.loc[['vyshnav','anirudh']]

,AI,OOPS,MP2,CNS,SPI,total
student 3,70,80,90,60,160,300
student 5,69,64,82,72,151,287

In [11]:
sum(df['OOPS'])

344